---
type: TopographyEditScope
namespace: Autodesk.Revit.DB.Architecture
version: 2024
members: 2
tags: [revit-api, class]
---

# TopographyEditScope

`Autodesk.Revit.DB.Architecture.TopographyEditScope` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | TopographyEditScope | 2014 | `public TopographyEditScope ( Document document , string transactionName )` |
| Method | Start | 2014 | `public ElementId Start ( ElementId topoSurfaceId )` |